{
	"ID" : 67,
	
	"Req_Title" : "Marketing Lead",
	
	"Location" : "Pune",
	
	"Experience" : "3-5 yrs",
	
	"Positions" : 1,
	
	"Job_Description" :"MyNextHire is a fast growing, modern applicant tracking system, aspiring to be India's best ATS and is looking for candidates with zeal and similar aspirations to join its dynamic team of professionals.<br><br>As a Marketing Lead, you will :<ul><li>Work with Marketing team to create, deliver, edit, and optimize all marketing materials.</li><li>Research and define the market for MyNextHire with as many details as possible about the clients. Keep it up to date with current sales status, competition status and draw insights from that data for marketing strategies</li><li>Lead the development of companywide social media management standards, policies, and rules of engagement.</li><li>Build and manage the company’s social media profiles and presence, including Facebook, Twitter, LinkedIn, and additional channels that may be deemed relevant.</li><li>Build and manage a rich content/editorial calendar that attracts a qualified audience to our owned properties (including blog posts, whitepapers, case studies, videos, webinars, infographics, etc.). Ensure that messages are supportive of and consistent with Netsync marketing strategies.</li><li>Grow new leads, including marketing-qualified leads, by converting site traffic through calls-to-action, landing pages, and lead generation content (including offers).</li><li>Collaborate with designers and external influencers and industry experts to produce relevant content that meets the needs of both key stakeholders and our audience.</li><li>Assist with all aspects of executing marketing events, tradeshows, customer events, and partner sessions. This includes site selection, negotiating contracts, banquet orders, assigning speakers, Confidential – Ver. 05032016 –For Internal Use Only– Page 2 ordering gifts/giveaways, off-site coordination of logistics, invitation development, emailing invitations, and tracking follow-up activities to measure results of the event (ROI).</li><li>Write and post press releases. Oversee relationship with PR newswire, as needed</li><li>Manage and update the company website.</li><li>Run ads and email sequences to help buyers make informed decisions after taking the product demo</li></ul>You should have:<ul><li>Two year of marketing/communications and event experience required, preferably in a professional services organization</li>Excellent verbal and written communication and presentation skills<li>Ability to enjoy working in a small team/startup environment</li>Strong planning, organizational and problem-solving skills, with good time management and attention to detail</li></ul>Location:<ul><li>Pune</li></ul>"
}