[
    {
        "ID" : 68,
        "Req_Title" : "Inside Sales Exexutive",
        "Location" : "Pune",
        "Experience" : "2-4 yrs",
        "Positions" : 2,
        "Job_Description" : "MyNextHire is a fast growing, modern applicant tracking system, aspiring to be India's best ATS and is looking for candidates with zeal and similar aspirations to join its dynamic team of professionals.<br><br>As an Inside Sales Executive, you will :<br><ul><li> Work with Marketing team to research and define the market for MyNextHire with as many details as possible about the clients.</li><li>Ability to discover contact details, reach the prospect through board-lines is a MUST</li><li>Work on the prospects assigned to you with an aim of educating the prospect on what MyNextHire does and setting up an online demo</li><li>Create, practice and perfect product pitch so that you are able to generate enough curiosity and interest in the minds of prospects to see the demo</li><br><li>Keep a record of all the calls made and develop, present insights about what is working and improvement areas</li><li>Follow up with the prospects until the prospect appears for the demo<li>Sometimes help the team to conduct product demo</li></ul>You should have:<ul><li>Two years of lead generation experience preferably in a professional services organization</li><li>Excellent verbal and written communication and presentation skills, Ability to enjoy working in a small team/startup environment</li><li>Strong planning, organizational and problem-solving skills, with good time management and attention to detail</li></ul>Location:<ul><li>Pune</li></ul>"
    },
	{
        "ID" : 66,
        "Req_Title" : "Customer Acquisition Manager",
        "Location" : "Pune",
        "Experience" : "3-10 yrs",
        "Positions" : 1,
        "Job_Description" : "Outmarch is a fast-growing, SaaS platform for the retailers, build ground up on modern cloud-based scalable and secure architecture.<br>Aspiring to be the best Retail Management by 2020 and is looking for candidates with zeal and similar aspirations to join its dynamic team of professionals.<br><br>As a Customer Acquisition Manager, you will secure new business through all fair means at your disposal, including not being afraid to pick up the phone.<br>Excellent salary package for the right candidate.<br>Develop your sales pipeline and consistently deliver on monthly and quarterly revenue targets.<br>Increase revenue through new business development of direct clients by effectively managing the sales pipeline, end to end, from prospecting to getting purchase orders from new accounts.<br>Establish strong working relationships with key client stakeholders<br><br>You should have:<ul><li>3-10 years experience in Retail product sales (P&L Experience is an added advantage)</li><li>1+ years demonstrated success in New Business Sales (SaaS product).</li><li>a strong commercial mindset and can understand P&L and financials.</li><li>Superb communication and presentation skills</li><li>Ability to enjoy working in a small team/startup environment</li></ul>"
    },
	{
		"ID" : 67,
        "Req_Title" : "Marketing Lead",
        "Location" : "Pune",
        "Experience" : "3-5 yrs",
        "Positions" : 1,
        "Job_Description" :"MyNextHire is a fast growing, modern applicant tracking system, aspiring to be India's best ATS and is looking for candidates with zeal and similar aspirations to join its dynamic team of professionals.<br><br>As a Marketing Lead, you will :<ul><li>Work with Marketing team to create, deliver, edit, and optimize all marketing materials.</li><li>Research and define the market for MyNextHire with as many details as possible about the clients. Keep it up to date with current sales status, competition status and draw insights from that data for marketing strategies</li><li>Lead the development of companywide social media management standards, policies, and rules of engagement.</li><li>Build and manage the company’s social media profiles and presence, including Facebook, Twitter, LinkedIn, and additional channels that may be deemed relevant.</li><li>Build and manage a rich content/editorial calendar that attracts a qualified audience to our owned properties (including blog posts, whitepapers, case studies, videos, webinars, infographics, etc.). Ensure that messages are supportive of and consistent with Netsync marketing strategies.</li><li>Grow new leads, including marketing-qualified leads, by converting site traffic through calls-to-action, landing pages, and lead generation content (including offers).</li><li>Collaborate with designers and external influencers and industry experts to produce relevant content that meets the needs of both key stakeholders and our audience.</li><li>Assist with all aspects of executing marketing events, tradeshows, customer events, and partner sessions. This includes site selection, negotiating contracts, banquet orders, assigning speakers, Confidential – Ver. 05032016 –For Internal Use Only– Page 2 ordering gifts/giveaways, off-site coordination of logistics, invitation development, emailing invitations, and tracking follow-up activities to measure results of the event (ROI).</li><li>Write and post press releases. Oversee relationship with PR newswire, as needed</li><li>Manage and update the company website.</li><li>Run ads and email sequences to help buyers make informed decisions after taking the product demo</li></ul>You should have:<ul><li>Two year of marketing/communications and event experience required, preferably in a professional services organization</li>Excellent verbal and written communication and presentation skills<li>Ability to enjoy working in a small team/startup environment</li>Strong planning, organizational and problem-solving skills, with good time management and attention to detail</li></ul>Location:<ul><li>Pune</li></ul>"
	},
	{
		"ID" : 65 ,
        "Req_Title" : "Customer Success - Executive  ",
        "Location" : "Pune",
        "Experience" : "0-2 yrs",
        "Positions" : 1,
        "Job_Description" : "A Customer Success Executive is responsible for developing customer relationships that promote retention and loyalty. Their job is to work closely with customers to ensure they are satisfied with the services they receive and to improve upon areas of dissatisfaction. They also act as the ears and eyes of our product team so we continuously learn from our existing customers.<br>Roles & Responsibilities:-<ol><li>Understand client needs with passion and provide best solutions to them</li><li>Build relationships of mutual benefit and ensure client success at all times</li><li>Negotiate internally with the product development team to get enhancements developed faster with priority for your set of clients</li><li>Ensure the product documentation is up to date and is used effectively.</li><li>Establish best practices and grow the team</li></ol>Skills:-<ol><li>Topclass communication skills</li><li>Empathy and passion for customer service</li><li>Attention to detail</li><li>Should be a quick learner</li><li>Ability to handle customers in any situation</li><li>Willingness to know the product inside out</li><li>Honest, dedicated, efficient, proactive and should have a can-do attitude</li></ol>"
	},
	{
		"ID" : 44,
        "Req_Title" : "Walkin - we are always hiring",
        "Location" : "Pune",
        "Experience" : "1-2 yrs",
        "Positions" : 0,
        "Job_Description" : "We are looking for a Walkin - we are always hiring to work with a great team of professionals.<br>You will bring:<ol><li>Expected Skills:</li><li>Optional Skills:</li></ol><br>Qualifications:<ol><li>Relevant experience of 1 - 2 years</li><li>Education:</li></ol>"
	},
	{
		"ID" : 58,
        "Req_Title" : "Customer Acquisition Manager ",
        "Location" : "Pune",
        "Experience" : "3-10 yrs",
        "Positions" : 1,
        "Job_Description" : "Responsibilities:<br>MyNextHire is a fast growing, modern applicant tracking system, aspiring to be India's best ATS by 2020 and is looking for candidates with zeal and similar aspirations to join its dynamic team of professionals.<br>As a Customer Acquisition Manager, you will secure new business through all fair means at your disposal, including not being afraid to pick up the phone.<br>Excellent salary package for the right candidate.<ul><li>Develop your sales pipeline and consistently deliver on monthly and quarterly revenue targets.</li><li>Increase revenue through new business development of direct clients by effectively managing the sales pipeline, end to end, from prospecting to getting purchase orders from new accounts</li><li>Establish strong working relationships with key client stakeholders</li></ul>You should have:<ul><li>3-10 years experience in IT product sales (P&L Experience is an added advantage)</li><li>1+ years demonstrated success in New Business Sales (SaaS product, marketing or HR tech desirable)</li><li>a strong commercial mindset and can understand P&L and financials.</li><li>Superb communication and presentation skills</li><li>Ability to enjoy working in a small team/startup environment</li></ul>Location Options:<ul><li>Mumbai, Bangalore</li></ul>"
	},
	{
		"ID" : 62,
        "Req_Title" : "Fullstack Javascript Developer ",
        "Location" : "Pune",
        "Experience" : "2-4 yrs",
        "Positions" : 1,
        "Job_Description" : "Required Skills: Bachelor's/ Master degree in computer science, information technology or related technical discipline. • 2 + years of experience in software development using java script. • Very strong experience using java script in UI and at server side. • Experience with AngularJS, ECMAScript 2015/TypeScript developer and willing to learn and teach new technologies quickly (such as Angular 2.0, React and new developments in JavaScript); • Experience with HTML5 & CSS3- Compatible, Responsive Web Application Design. • Experience with Javascript (ES6) on server using node.js. • Be a skilled NodeJS, ExpressJS, and MongoDB developer with an emphasis on building RESTful APIs; • Experience with asynchronous programming techniques (promises, observables, generators, async/await) • Git experience: essential. Feature branches, merging, rebase, squash commits, pull requests, etc. • Experience with NoSQL / Mongo DB (Mongo DB, DynamoDB preferred) • Experience using testing frameworks: mocha, chai, selenium, karma. • In our fast-paced environment the ability to multi-task while maintaining attention to detail is a must.<br><br>• Knowledgeable or experience with developing multi tenant cloud based SaaS applications. • Knowledgeable or experience with developing applications for mobile devices. • Knowledgeable or experience with serverless microservices architecture. • Knowledge/ experience with AWS services. • Knowledge/ experience with retail applications. • Preferably experience in start-ups, small teams"
	},
	{
		"ID" : 60,
        "Req_Title" : "Lead UI Developer",
        "Location" : "Pune",
        "Experience" : "2-5 yrs",
        "Positions" : 1,
        "Job_Description" : "RESPONSIBILITIES:<ul><li>Lead UI design and development of product modules independently</li><li>Influence and maintain coding standards</li><li>Interact with key stakeholders and exchange information</li><li>Drive constant innovation, performance tuning, automation</li></ul>SKILLS:<ul><li>Demonstrable experience of 2-5 years in UI development (angular js, angular 6, javascript, html, css) is a MUST. No PHP.</li><li>Working knowledge of supporting libraries like moment.js, angular UI utils etc</li><li>Understanding of REST APIs and working with them is a MUST</li><li>Must have demonstrable experience of working in at least one chart library like chart.js, d3.js, zingchart</li><li>Excellent grip over bootstrap, html5 and css/less/sass required.</li><li>Ability to integrate open source libraries independently </li><li>Version control systems like GIT, SVN </li><li>Strong problem solving, debugging, troubleshooting skills</li><li>Ability to effectively communicate with other team members - technical, testers and business users </li><li>Knowledge of React Native, KarmaJS, Jasmine, MochaJS, Selenium is an added advantage</li></ul>EDUCATION:<ul><li>BE/BTech from a reputed institute with excellent grades</li></ul>"
	},
	{
		"ID" : 59,
        "Req_Title" : "MyNextHire Product Evangelist  ",
        "Location" : "Pune",
        "Experience" : "10-15 yrs",
        "Positions" : 1,
        "Job_Description" : "<ul><li>You’re our sales team’s best friend. You make sure they have everything they need to turn leads into sales and to do outbound prospecting. Battle cards, prospect ready videos, conversion tips and tricks, FAQs, product teasers, facts & figures and other great funnel catalysts.</li><li>You’re our rockstar on stage. You build videos, organize webinars and deliver demos as great performances to show the world how awesome our solutions are. Your face will be part of the Invisible brand as you’ll be on the screen of our users as they onboard and use our products.</li><li>Sales will involve you as their secret weapon to bring in the largest deals using your charm and product expertise, wrapped in a great show. You can build report with users of our service, and behave at the highest level when engaging with enterprise clients.</li><li>Video content, podcasts, customer interviews and social media engagement are what you do every day. You live in digital media. Building your own radio show does not scare you. You can interview others and use your curiosity and empathy with other people to become the stars of the show.</li><li>Customers will remember your name. You’ll be the person they remember and want to see again. You get our community to love what we have to offer and become a community who engages with us. You’ll be owning a lot of our social media engagements with our digital audiences.</li><li>Your KPIs are growing “Engaged Advocates” (people who use, like and share using our product), conversions, ARPU and reviews of your events.</li></ul>"
	}
]